tutorials/rhopSonicFoam/shockTube/system/setFieldsDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U     (0 0 0)
    volScalarFieldValue T     348.43206
    volScalarFieldValue p     1.0e+5
);

regions
(
    boxToCell
    {
        box    (0 -1 -1) (5 1 1);

        fieldValues
        (
            volScalarFieldValue T     278.74564
            volScalarFieldValue p     1.0e+4
        );
    }
);

// ************************************************************************* //
